app/views/gossips/show.html.erb

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<p>
  Potin n° <%= Gossip.find(params[:id]).id %><br/>
  Son auteur :  <%= Gossip.find(params[:id]).user.name %><br/>
  Son titre :  <%= Gossip.find(params[:id]).title %><br/>
  Et le gossip : <%= Gossip.find(params[:id]).content %><br/>