app/controllers/gossips_controller.rb

  def create
    @gossip = Gossip.new(title: params["title"], content: params["content"], user_id: 11) # avec xxx qui sont les données obtenues à partir du formulaire

    if @gossip.save # essaie de sauvegarder en base @gossip
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "title"], ["content", "content"], ["user_id", 11], ["created_at", "2021-02-09 15:07:41.425721"], ["updated_at", "2021-02-09 15:07:41.425721"]]